In [1]:
import pandas as pd
import numpy as np

In [2]:
Nigerian_weather = pd.DataFrame({
    'city': ['Lagos', 'Ibadan', 'Benin'],
    'temperature': [32,48,50],
    'humidity': [80,70,79]   
})
Nigerian_weather

     city  temperature  humidity
0   Lagos           32        80
1  Ibadan           48        70
2   Benin           50        79

In [4]:
us_weather = pd.DataFrame({
    'city': ['Chicago', 'New York', 'Texas'],
    'temperature': [30,14,30],
    'humidity': [70,60,79]   
})
us_weather

       city  temperature  humidity
0   Chicago           30        70
1  New York           14        60
2     Texas           30        79

In [10]:
df=pd.concat([Nigerian_weather,us_weather],ignore_index=True)
df

       city  temperature  humidity
0     Lagos           32        80
1    Ibadan           48        70
2     Benin           50        79
3   Chicago           30        70
4  New York           14        60
5     Texas           30        79

In [9]:
us_weather.dtypes

city           object
temperature     int64
humidity        int64
dtype: object

In [12]:
df=pd.concat([Nigerian_weather,us_weather],keys=['Nigerian','us'])
df

                city  temperature  humidity
Nigerian 0     Lagos           32        80
         1    Ibadan           48        70
         2     Benin           50        79
us       0   Chicago           30        70
         1  New York           14        60
         2     Texas           30        79

In [13]:
df.loc['us']

       city  temperature  humidity
0   Chicago           30        70
1  New York           14        60
2     Texas           30        79

In [14]:
df.loc['Nigerian']

     city  temperature  humidity
0   Lagos           32        80
1  Ibadan           48        70
2   Benin           50        79

In [15]:
#apppend
#temperature
temperature_df = pd.DataFrame({
    'city': ['Lagos', 'Ibadan', 'Benin'],
    'temperature': [32,48,50],
       
})
temperature_df

     city  temperature
0   Lagos           32
1  Ibadan           48
2   Benin           50

In [16]:
windspeed_df = pd.DataFrame({
    'city': ['Lagos', 'Ibadan', 'Benin'],
    'windspeed': [7,12,10],
       
})
windspeed_df

     city  windspeed
0   Lagos          7
1  Ibadan         12
2   Benin         10

In [21]:
wind_temp_df=pd.concat([temperature_df,windspeed_df],axis=1)

In [22]:
wind_temp_df

     city  temperature    city  windspeed
0   Lagos           32   Lagos          7
1  Ibadan           48  Ibadan         12
2   Benin           50   Benin         10

In [25]:
#TWrite the series S in upper case
s = pd.Series(['Humid','Dry','Rain'],name='event')
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [27]:
df_event =pd.concat([temperature_df,s],axis=1)
df_event

     city  temperature  event
0   Lagos           32  Humid
1  Ibadan           48    Dry
2   Benin           50   Rain